var searchData=
[
  ['тестирование_0',['Тестирование',['../md__r_e_a_d_m_e__db__wrapper.html#autotoc_md18',1,'🧪 Тестирование'],['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md114',1,'🧪 Тестирование']]],
  ['таблицам_20для_20отладки_20и_20мониторинга_1',['Информация по таблицам (для отладки и мониторинга)',['../md__read_me___i_r_c.html#autotoc_md78',1,'']]],
  ['таблиц_2',['🏗️ Структура таблиц',['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md112',1,'']]],
  ['таблиц_20локальная_20сборка_20без_20docker_3',['таблиц локальная сборка без Docker',['../md__read_me___i_r_c.html#autotoc_md77',1,'Для удаления таблиц (локальная сборка, без Docker)'],['../md__read_me___i_r_c.html#autotoc_md76',1,'Скрипт для создания таблиц (локальная сборка, без Docker)']]],
  ['текущей_20комнаты_4',['Получить название текущей комнаты',['../md__read_me___i_r_c.html#autotoc_md60',1,'']]],
  ['тесты_5',['7. Запустить только тесты',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md30',1,'']]],
  ['токену_6',['Общие ошибки для всех запросов с авторизацией по токену',['../md__read_me___i_r_c.html#autotoc_md69',1,'']]],
  ['токен_7',['Вход (выдает новый токен)',['../md__read_me___i_r_c.html#autotoc_md50',1,'']]],
  ['токен_20аннулируется_8',['Выход (токен аннулируется)',['../md__read_me___i_r_c.html#autotoc_md51',1,'']]],
  ['только_20сервер_20и_20бд_9',['6. Запустить только сервер и БД',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md29',1,'']]],
  ['только_20тесты_10',['7. Запустить только тесты',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md30',1,'']]]
];
