var searchData=
[
  ['для_20удаления_20таблиц_20локальная_20сборка_20без_20docker_0',['Для удаления таблиц (локальная сборка, без Docker)',['../md__read_me___i_r_c.html#autotoc_md77',1,'']]],
  ['данных_3a_1',['Подключение к базе данных:',['../md__read_me___i_r_c.html#autotoc_md79',1,'']]],
  ['диагностики_2',['9. Войти в контейнер для ручной диагностики',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md32',1,'']]],
  ['длиной_20имени_3',['Список пользователей с их хешами и длиной имени',['../md__read_me___i_r_c.html#autotoc_md80',1,'']]],
  ['для_20бд_4',['2. Создайте файл &lt;tt&gt;.env&lt;/tt&gt; с переменными для БД',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md25',1,'']]],
  ['для_20аутентификации_5',['REST API для аутентификации',['../md__read_me___i_r_c.html#autotoc_md48',1,'']]],
  ['для_20всех_20запросов_20с_20авторизацией_20по_20токену_6',['Общие ошибки для всех запросов с авторизацией по токену',['../md__read_me___i_r_c.html#autotoc_md69',1,'']]],
  ['для_20отладки_7',['🛠 Полезные команды для отладки',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md41',1,'']]],
  ['для_20отладки_20и_20мониторинга_8',['Информация по таблицам (для отладки и мониторинга)',['../md__read_me___i_r_c.html#autotoc_md78',1,'']]],
  ['для_20работы_20с_20бд_9',['6. &lt;tt&gt;IRCDBWrapper&lt;/tt&gt; (высокоуровневая обёртка для работы с БД)',['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md102',1,'']]],
  ['для_20работы_20с_20бд_20irc_20чата_10',['IRCDBWrapper — упрощённый интерфейс для работы с БД IRC-чата',['../md__r_e_a_d_m_e__db__wrapper.html',1,'']]],
  ['для_20работы_20с_20комнатами_11',['REST API для работы с комнатами',['../md__read_me___i_r_c.html#autotoc_md56',1,'']]],
  ['для_20работы_20с_20пользователями_12',['REST API для работы с пользователями',['../md__read_me___i_r_c.html#autotoc_md53',1,'']]],
  ['для_20работы_20с_20сообщениями_13',['REST API для работы с сообщениями',['../md__read_me___i_r_c.html#autotoc_md64',1,'']]],
  ['для_20ручной_20диагностики_14',['9. Войти в контейнер для ручной диагностики',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md32',1,'']]],
  ['для_20создания_20таблиц_20локальная_20сборка_20без_20docker_15',['Скрипт для создания таблиц (локальная сборка, без Docker)',['../md__read_me___i_r_c.html#autotoc_md76',1,'']]],
  ['для_20ci_20cd_16',['💡 Рекомендации для CI/CD',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md39',1,'']]],
  ['других_20библиотек_17',['Установка drogon и других библиотек',['../md__read_me___i_r_c.html#autotoc_md72',1,'']]]
];
