var searchData=
[
  ['установка_20drogon_20и_20других_20библиотек_0',['Установка drogon и других библиотек',['../md__read_me___i_r_c.html#autotoc_md72',1,'']]],
  ['участие_20в_20комнатах_1',['Участие в комнатах',['../md__r_e_a_d_m_e__db__wrapper.html#autotoc_md10',1,'Участие в комнатах'],['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md105',1,'Участие в комнатах']]],
  ['удаления_20таблиц_20локальная_20сборка_20без_20docker_2',['Для удаления таблиц (локальная сборка, без Docker)',['../md__read_me___i_r_c.html#autotoc_md77',1,'']]],
  ['удалить_20контейнеры_3',['8. Остановить и удалить контейнеры',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md31',1,'']]],
  ['упрощённый_20интерфейс_20для_20работы_20с_20бд_20irc_20чата_4',['IRCDBWrapper — упрощённый интерфейс для работы с БД IRC-чата',['../md__r_e_a_d_m_e__db__wrapper.html',1,'']]],
  ['участников_20комнаты_5',['Получить список участников комнаты',['../md__read_me___i_r_c.html#autotoc_md62',1,'']]]
];
