var searchData=
[
  ['название_20текущей_20комнаты_0',['Получить название текущей комнаты',['../md__read_me___i_r_c.html#autotoc_md60',1,'']]],
  ['на_20сервер_1',['Сохранение сообщения в БД (выполнять запрос после отправки сообщений на сервер!)',['../md__read_me___i_r_c.html#autotoc_md66',1,'']]],
  ['новую_20комнату_2',['Создать новую комнату',['../md__read_me___i_r_c.html#autotoc_md57',1,'']]],
  ['новый_20токен_3',['Вход (выдает новый токен)',['../md__read_me___i_r_c.html#autotoc_md50',1,'']]]
];
