var searchData=
[
  ['бд_0',['БД',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md25',1,'2. Создайте файл &lt;tt&gt;.env&lt;/tt&gt; с переменными для БД'],['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md29',1,'6. Запустить только сервер и БД'],['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md102',1,'6. &lt;tt&gt;IRCDBWrapper&lt;/tt&gt; (высокоуровневая обёртка для работы с БД)']]],
  ['бд_20выполнять_20запрос_20после_20отправки_20сообщений_20на_20сервер_1',['Сохранение сообщения в БД (выполнять запрос после отправки сообщений на сервер!)',['../md__read_me___i_r_c.html#autotoc_md66',1,'']]],
  ['бд_20irc_20чата_2',['IRCDBWrapper — упрощённый интерфейс для работы с БД IRC-чата',['../md__r_e_a_d_m_e__db__wrapper.html',1,'']]],
  ['быстрый_20старт_3',['🚀 Быстрый старт',['../md__r_e_a_d_m_e__db__wrapper.html#autotoc_md3',1,'']]],
  ['быстрый_20старт_20с_20docker_20compose_4',['🐳 Быстрый старт с Docker Compose',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md23',1,'']]],
  ['базе_20данных_3a_5',['Подключение к базе данных:',['../md__read_me___i_r_c.html#autotoc_md79',1,'']]],
  ['без_20docker_6',['без Docker',['../md__read_me___i_r_c.html#autotoc_md77',1,'Для удаления таблиц (локальная сборка, без Docker)'],['../md__read_me___i_r_c.html#autotoc_md76',1,'Скрипт для создания таблиц (локальная сборка, без Docker)']]],
  ['библиотек_7',['Установка drogon и других библиотек',['../md__read_me___i_r_c.html#autotoc_md72',1,'']]]
];
