var searchData=
[
  ['войти_20в_20контейнер_20для_20ручной_20диагностики_0',['9. Войти в контейнер для ручной диагностики',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md32',1,'']]],
  ['вход_20выдает_20новый_20токен_1',['Вход (выдает новый токен)',['../md__read_me___i_r_c.html#autotoc_md50',1,'']]],
  ['выйти_20в_20общую_20комнату_20перейти_20в_20комнату_20general_5froom_2',['Выйти в общую комнату (перейти в комнату GENERAL_ROOM)',['../md__read_me___i_r_c.html#autotoc_md59',1,'']]],
  ['выход_20из_20psql_3a_3',['Выход из psql:',['../md__read_me___i_r_c.html#autotoc_md83',1,'']]],
  ['выход_20токен_20аннулируется_4',['Выход (токен аннулируется)',['../md__read_me___i_r_c.html#autotoc_md51',1,'']]],
  ['всех_20запросов_20с_20авторизацией_20по_20токену_5',['Общие ошибки для всех запросов с авторизацией по токену',['../md__read_me___i_r_c.html#autotoc_md69',1,'']]],
  ['всех_20комнат_6',['всех комнат',['../md__read_me___i_r_c.html#autotoc_md61',1,'Получить список всех комнат'],['../md__read_me___i_r_c.html#autotoc_md81',1,'Список всех комнат']]],
  ['всех_20подключенных_20клиентов_20websocket_7',['Получить список всех подключенных клиентов WebSocket',['../md__read_me___i_r_c.html#autotoc_md54',1,'']]],
  ['все_20контейнеры_8',['4. Постройте и запустите все контейнеры',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md27',1,'']]],
  ['выборка_9',['🔄 Пагинация (постраничная выборка)',['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md108',1,'']]],
  ['выдает_20новый_20токен_10',['Вход (выдает новый токен)',['../md__read_me___i_r_c.html#autotoc_md50',1,'']]],
  ['выполнять_20запрос_20после_20отправки_20сообщений_20на_20сервер_11',['Сохранение сообщения в БД (выполнять запрос после отправки сообщений на сервер!)',['../md__read_me___i_r_c.html#autotoc_md66',1,'']]],
  ['высокоуровневая_20обёртка_20для_20работы_20с_20бд_12',['6. &lt;tt&gt;IRCDBWrapper&lt;/tt&gt; (высокоуровневая обёртка для работы с БД)',['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md102',1,'']]],
  ['в_20бд_20выполнять_20запрос_20после_20отправки_20сообщений_20на_20сервер_13',['Сохранение сообщения в БД (выполнять запрос после отправки сообщений на сервер!)',['../md__read_me___i_r_c.html#autotoc_md66',1,'']]],
  ['в_20каталог_20проекта_14',['1. Клонируйте репозиторий и перейдите в каталог проекта',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md24',1,'']]],
  ['в_20комнатах_15',['в комнатах',['../md__r_e_a_d_m_e__db__wrapper.html#autotoc_md10',1,'Участие в комнатах'],['../md__r_e_a_d_m_e__irc__chat__db.html#autotoc_md105',1,'Участие в комнатах']]],
  ['в_20комнате_16',['Получение последних N сообщений в комнате',['../md__read_me___i_r_c.html#autotoc_md67',1,'']]],
  ['в_20комнату_20general_5froom_17',['Выйти в общую комнату (перейти в комнату GENERAL_ROOM)',['../md__read_me___i_r_c.html#autotoc_md59',1,'']]],
  ['в_20контейнер_20для_20ручной_20диагностики_18',['9. Войти в контейнер для ручной диагностики',['../md__r_e_a_d_m_e___d_o_c_k_e_r.html#autotoc_md32',1,'']]],
  ['в_20общую_20комнату_20перейти_20в_20комнату_20general_5froom_19',['Выйти в общую комнату (перейти в комнату GENERAL_ROOM)',['../md__read_me___i_r_c.html#autotoc_md59',1,'']]]
];
